===
Simple GET
===

GET https://example.org/api/dogs

---

(source_file (request (method)))


===
Simple GET with comment
===

GET https://example.org/api/dogs # Hello

---

(source_file (request (method) (comment)))

===
simple GET with header
===

GET https://example.org/api/dogs
user-agent: my user agent

---

(source_file (request (method) (header (key_value (key) (value)))))

===
simple GET with header multiple headers
===

GET https://example.org/api/dogs
user-agent: my user agent
Content-Type: application/json

---

(source_file 
 (request (method) 
  (header (key_value (key) (value))) 
  (header (key_value (key) (value)))))
